instr="""Добро пожаловать в программу по определению состояния здоровья!
Данное приложение позволит вам с помощью теста Руфье провести первичную диагностику вашего здоровья.
Проба Руфье представляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрузке.
у испытуемого, находящегося в положении лежа на спине в течение 5 мин, определяют частоту пульса за 15 секунд;
 затем в течение 45 секунд испытуемый выполняет 30 приседаний.
После окончания нагрузки испытуемый ложится, и у него вновь подсчитывается число пульсаций за первые 15 секунд,
а потом - за последние 15 секунд первой минуты периода восстановления.
Важно! Если в процессе проведения испытания вы почувствуете себя плохо (появится головокружение, шум в ушах, сильная одышка и др.),
 то тест необходимо прервать и обратиться к врачу."""
name_window1='Здоровье'
name_window3="Результаты"
size_window1=400
size_window2=500
win2_text1="Введите Ф.И.О"
win2_text2='Полных лет'
win2_text3='''Лягте на спину и замерьте пульс за 15 секунд. Нажмите кнопку "Начать первый тест,
чтобы запустить таймер. Результат запишите в соответствующее поле.'''
win2_text4='''Выполните 30 приседаний за 45 секунд.
Для этого нажмите кнопку "Начать делать приседания", чтобы запустить счетчик приседаний.'''
win2_text5='''Лягте на спину и замерьте пульс сначала за первые 15 секунд минуты, затем за последние 15 секунд.
 Нажмите кнопку "Начать финальный тест", чтобы запустить таймер.
Зеленым обозначены секунды, в течение которых необходимо проводить измерения, 
черным - минуты без замера пульсаций. Результаты запишите в соответствующие поля.'''
txt_index = 'Индекс Руфье'
txt_workheart ='Работоспособность сердца'
txt_res1 = "низкая. Срочно обратитесь к врачу!"
txt_res2 ="удовлетворительная. Обратитесь к врачу!"
txt_res3 = "средняя. Возможно, стоит дополнительно обследоваться у врача."
txt_res4 = "выше среднего"
txt_res5="высокая"

